In [1]:
import pandas as pd
import numpy as np

In [2]:
names = ["John","Shawn","Tom","Matt","John","Steve","Smith","Ricky","Adam"]
pd.Series(names)

0     John
1    Shawn
2      Tom
3     Matt
4     John
5    Steve
6    Smith
7    Ricky
8     Adam
dtype: object

In [3]:
x = np.random.randint(1,10,(5,5))

In [5]:
# pd.Series(x)

In [6]:
dept = ["IT","IT","HR","HR","IT","SALES","IT","SALES","HR"]
data = {
    "names" : names,
    "dept" : dept
}

In [8]:
pd.Series(data)

names    [John, Shawn, Tom, Matt, John, Steve, Smith, R...
dept            [IT, IT, HR, HR, IT, SALES, IT, SALES, HR]
dtype: object

In [9]:
pd.DataFrame(data)

   names   dept
0   John     IT
1  Shawn     IT
2    Tom     HR
3   Matt     HR
4   John     IT
5  Steve  SALES
6  Smith     IT
7  Ricky  SALES
8   Adam     HR

In [10]:
df = pd.DataFrame(data)

In [11]:
df['names']

0     John
1    Shawn
2      Tom
3     Matt
4     John
5    Steve
6    Smith
7    Ricky
8     Adam
Name: names, dtype: object

In [12]:
series = pd.Series(names)

In [13]:
series

0     John
1    Shawn
2      Tom
3     Matt
4     John
5    Steve
6    Smith
7    Ricky
8     Adam
dtype: object

In [14]:
series[0]

'John'

In [15]:
series[1]

'Shawn'

In [16]:
series = pd.Series(names, index=['a','b','c','d','e','f','g','h','i'])

In [17]:
series

a     John
b    Shawn
c      Tom
d     Matt
e     John
f    Steve
g    Smith
h    Ricky
i     Adam
dtype: object

In [18]:
series[0]

'John'

In [19]:
series[0:4]

a     John
b    Shawn
c      Tom
d     Matt
dtype: object

In [20]:
df = pd.DataFrame(data, index=['a','b','c','d','e','f','g','h','i'])

In [21]:
df

   names   dept
a   John     IT
b  Shawn     IT
c    Tom     HR
d   Matt     HR
e   John     IT
f  Steve  SALES
g  Smith     IT
h  Ricky  SALES
i   Adam     HR

In [23]:
# Indexing is not allowed in data frames
# df[0]

In [24]:
df[0:4]

   names dept
a   John   IT
b  Shawn   IT
c    Tom   HR
d   Matt   HR

In [25]:
df.columns

Index(['names', 'dept'], dtype='object')

In [28]:
# df['names']
# df['dept']

In [29]:
df['names'][0]

'John'

In [30]:
df.iloc

In [31]:
df.iloc[0]

names    John
dept       IT
Name: a, dtype: object

In [32]:
df.iloc[0:3]

   names dept
a   John   IT
b  Shawn   IT
c    Tom   HR

In [33]:
# return first 5 rows
df.head()

   names dept
a   John   IT
b  Shawn   IT
c    Tom   HR
d   Matt   HR
e   John   IT

In [34]:
df.head(3)

   names dept
a   John   IT
b  Shawn   IT
c    Tom   HR

In [35]:
# will return last 5 rows
df.tail()

   names   dept
e   John     IT
f  Steve  SALES
g  Smith     IT
h  Ricky  SALES
i   Adam     HR